/*================================================================
*   Copyright (C) 2020 Sangfor Ltd. All rights reserved.
*   
*   文件名称：array_02.c
*   创 建 者：Chenlvqing
*   创建日期：2020年03月03日
*   描    述：
*
================================================================*/


#include<stdio.h>
int main()
{
	int a[4][3];
	printf("a=%p  &a=%p  a[0]=%p  &a[0][0]=%p\n",a,&a,a[0],&a[0][0]);
    
	//a+1 增加了每行的字节数 12  //&a+1 增加了整个二维数组的字节数  12*4=48  //a[0]+1 增加了数组元素的字节数  4  //&a[0][0]+1  增加了数组元素的字节数   4
	printf("a+1=%p  &a+1=%p  a[0]+1=%p  &a[0][0]+1=%p\n",a+1,&a+1,a[0]+1,&a[0][0]+1);
	return 0;
}
