#include "head.h"

void stu_ui()
{
	printf("/*********************************************************************************/\n");
	printf("/*********************************************************************************/\n");
	printf("/*********************************************************************************/\n");
	if(login_status==0)
	{
		printf("/***********************欢迎进入学生操作模块界面********************************/\n");
	}
	else
	{
		printf("/***********************欢迎返回学生操作模块界面********************************/\n");
	}
	printf("/***********************1.添加学生自身的信息******************************************/\n");
	printf("/***********************2.修改学生自身的信息(更新)************************************/\n");
	printf("/***********************3.删除学生自身的信息*********************************/\n");
	printf("/***********************4.查询学生自身的信息******************************************/\n");
	printf("/***********************5.查询学生本学期的科目******************************************/\n");
	printf("/***********************6.查询学生本学期的成绩*****************************************/\n");
	printf("/*********************************************************************************/\n");
	printf("/*********************************************************************************/\n");
	printf("/*********************************************************************************/\n");
}

void stu_manager(user_info_t *userinfo,MYSQL *mysql)
{
	//结构体变量的声明
	stu_info_t      *stuinfo;//学生信息
	stu_sub_t       *stusub;//学生学期科目
	stu_score_t     *stuscore;//学生学期科目成绩
	college_info_t  *collegeinfo;//学院
	profs_info_t    *profsinfo;//专业
	sub_info_t      *subinfo;//科目
	
	//分配内存
	stuinfo = (stu_info_t*)malloc(sizeof(stu_info_t));


	//管理员管理模块界面
	stu_ui();

	/*与数据库进行交互 变量声明*/
	MYSQL_RES *res = NULL;//数据库查询的结果集
	MYSQL_ROW row=NULL;//char**  指向一个字符串数组，从结果集中取得数据
	char query[500]={0};//放入sql语句
	//int fields=0;//数据表中的字段数  列数
	//int row_count=0;//行数

	char ch;//输入的字符:1,2,3,4,5,60---退出
	printf("请输入你的选项:\n");
	while((ch = getchar()) != '0')
	{
		if(ch == '\n')
			continue;
		switch(ch)
		{
			case '1':
				printf("添加学生自身的信息\n");
				break;
			case '2':
				printf("修改学生自身的信息(更新)\n");
				break;
			case '3':
				printf("删除学生自身的信息\n");
				break;
			case '4':
				printf("查询学生自身的信息\n");
				break;
			case '5':
				printf("查询学生本学期的科目\n");
				break;
			case '6':
				printf("查询学生本学期的成绩\n");
				break;
			default:
				break;

		}
	}
	//释放内存
	free(stuinfo);
}
